Tekla.Structures.AnalysisInternal.DotAnalysisDecomposedSelfweightLoad
Serialization structure for AnalysisDecomposedSelfweightLoad.

Tekla.Structures.AnalysisInternal.DotAnalysisDecomposedSelfweightLoad.AnalysisDecomposedLoad
The analysis decomposed load.

Tekla.Structures.AnalysisInternal.DotAnalysisDecomposedSelfweightLoad._NumberOfDirections
The number of directions of the analysis decomposed node load.

Tekla.Structures.AnalysisInternal.DotAnalysisDecomposedSelfweightLoad._NumberOfFactors
The number of factors of the analysis decomposed node load.

Tekla.Structures.AnalysisInternal.DotAnalysisDecomposedSelfweightLoad._Directions
The directions of the analysis decomposed node load.

Tekla.Structures.AnalysisInternal.DotAnalysisDecomposedSelfweightLoad._Factors
The factors of the analysis decomposed node load.

Tekla.Structures.AnalysisInternal.DotAnalysisDecomposedSelfweightLoad.ToStruct(Tekla.Structures.Analysis.AnalysisDecomposedSelfweightLoad)
DO NOT USE! For internal usage only!
P: P.

Tekla.Structures.AnalysisInternal.DotAnalysisDecomposedSelfweightLoad.FromStruct(Tekla.Structures.Analysis.AnalysisDecomposedSelfweightLoad)
DO NOT USE! For internal usage only!
P: P.